[
  {
    "ticker": "ADS.DE",
    "yf_ticker": "ADS.DE",
    "name": "adidas AG",
    "sector": "Consumer Cyclical",
    "industry": "Footwear & Accessories",
    "website": "https://www.adidas-group.com",
    "description": "adidas AG, together with its subsidiaries, designs, develops, produces, and markets a range of athletic and sports lifestyle products in Europe, Greater China, Japan, South Korea, Latin America, North America, and internationally. The company offers footwear and apparel, as well as accessories and gear, including bags, balls, sunglasses, and fitness equipment under the adidas brand; golf footwear and apparel under the adidas Golf brand; and outdoor footwear under the Five Ten brand. It sells its products through its own retail stores, mono-branded franchise stores, shop-in-shops, joint ventures with retail partners, and co-branded stores, as well as through its wholesale and e-commerce channels. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "market_cap": 29496309760,
    "logo_url": "",
    "fifty_two_week_change": -0.34573174,
    "current_price": 165.2,
    "currency": "EUR"
  },
  {
    "ticker": "AIR.PA",
    "yf_ticker": "AIR.DE",
    "name": "Airbus SE",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "website": "https://www.airbus.com",
    "description": "Airbus SE, together with its subsidiaries, engages in the design, manufacture, and delivery of aeronautics  and aerospace products, services, and solutions worldwide. It operates through three segments: Airbus, Airbus Helicopters, and Airbus Defence and Space. The Airbus segment develops, manufactures, markets, and sells commercial jet passenger aircraft, freighter aircraft, regional turboprop aircraft, and aircraft components, as well as provides aircraft conversion and related services. The Airbus Helicopters segment develops, manufactures, markets, and sells civil and military helicopters; and provides helicopter-related services. The Airbus Defence and Space segment designs, develops, delivers, and supports manned and unmanned military air systems and related services. This segment also offers civil and defence space systems for telecommunications, earth observations, navigation, and science and orbital systems; missile and space launcher systems; and services around data processing from platforms, secure communication, and cyber security. The company was formerly known as Airbus Group SE and changed its name to Airbus SE in April 2017. The company was incorporated in 1998 and is headquartered in Leiden, the Netherlands.",
    "market_cap": 169677144064,
    "logo_url": "",
    "fifty_two_week_change": 0.36592996,
    "current_price": 214.95,
    "currency": "EUR"
  },
  {
    "ticker": "ALV.DE",
    "yf_ticker": "ALV.DE",
    "name": "Allianz SE",
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "website": "https://www.allianz.com",
    "description": "Allianz SE, together with its subsidiaries, provides property-casualty insurance, life/health insurance, and asset management products and services Internationally. The company's Property-Casualty segment offers various insurance products, including motor liability, accident, fire and property, legal expense, credit, and travel to private and corporate customers. Its Life/Health segment provides a range of life and health insurance products on an individual and a group basis, such as annuities, endowment and term insurance, and unit-linked and investment-oriented products, as well as private and supplemental health, and long-term care insurance products. The company's Asset Management segment offers institutional and retail asset management products and services to third-party investors comprising equity and fixed income funds, cash, and multi-assets; and alternative investment products that include real estate, infrastructure debt/equity, real assets, and liquid alternatives. Its Corporate and Other segment provides banking services for retail clients, as well as digital investment services. Allianz SE was founded in 1890 and is headquartered in Munich, Germany.",
    "market_cap": 150095134720,
    "logo_url": "",
    "fifty_two_week_change": 0.28053248,
    "current_price": 389.3,
    "currency": "EUR"
  },
  {
    "ticker": "BAS.DE",
    "yf_ticker": "BAS.DE",
    "name": "BASF SE",
    "sector": "Basic Materials",
    "industry": "Chemicals",
    "website": "https://www.basf.com",
    "description": "BASF SE operates as a chemical company worldwide. It operates through six segments: Chemicals, Materials, Industrial Solutions, Surface Technologies, Nutrition & Care, and Agricultural Solutions. The Chemicals segment provides petrochemicals and intermediates. The Materials segment offers advanced materials and their precursors for applications and systems comprising isocyanates, polyamides, and inorganic basic products, as well as specialties for plastics and plastics processing industries. The Industrial Solutions segment develops and markets ingredients and additives for industrial applications, such as polymer dispersions, resins, additives, electronic materials, and antioxidants for automotive, plastics and adhesives, paints and coatings, construction, electronics, paper coatings, and energy and resources industries. The Surface Technologies segment provides catalysts, battery materials, automotive OEM and refinish coatings, surface treatment, and precious and base metal services for the automotive and chemical industries. The Nutrition & Care segment offers ingredients for consumer applications in the areas of nutrition, home, and personal care applications; and serves the food and feed producers, pharmaceutical, cosmetics, detergents, and cleaner industries, as well as fast-moving consumer goods sector. The Agricultural Solutions segment provides seeds and traits, and seed treatment products; fungicides, herbicides, insecticides, and biological crop protection products; and digital solutions. The company engages in engineering and other; rental and leasing; and commodity trading activities. BASF SE was founded in 1865 and is headquartered in Ludwigshafen am Rhein, Germany.",
    "market_cap": 39583358976,
    "logo_url": "",
    "fifty_two_week_change": 0.0536865,
    "current_price": 44.35,
    "currency": "EUR"
  },
  {
    "ticker": "BAYN.DE",
    "yf_ticker": "BAYN.DE",
    "name": "Bayer Aktiengesellschaft",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "website": "https://www.bayer.com",
    "description": "Bayer Aktiengesellschaft operates as a life science company worldwide. The company operates through Pharmaceuticals, Consumer Health, and Crop Science segments. The Pharmaceuticals segment provides prescription products primarily for cardiology and women's health care; specialty therapeutics in the areas of oncology, hematology, and ophthalmology; and diagnostic imaging equipment and contrast agents, as well as cell and gene therapy. The Consumer Health segment markets nonprescription over-the-counter medicines, medical products, medicated skincare products, nutritional supplements, pain and cardiovascular risk prevention products, digestive health products, allergy products, and cold and cough products. The Crop Science segment offers chemical and biological crop protection products, improved plant traits, seeds, digital solutions, and pest and weed management products, as well as customer services for agriculture. It also engages in the breeding, propagation, and production/processing of seeds, including seed dressing. The company distributes its products through wholesalers, pharmacies and pharmacy chains, supermarkets, online and other retailers, and hospitals, as well as directly to farmers. Bayer Aktiengesellschaft was founded in 1863 and is based in Leverkusen, Germany.",
    "market_cap": 38864695296,
    "logo_url": "",
    "fifty_two_week_change": 0.94047976,
    "current_price": 39.56,
    "currency": "EUR"
  },
  {
    "ticker": "BEI.DE",
    "yf_ticker": "BEI.DE",
    "name": "Beiersdorf Aktiengesellschaft",
    "sector": "Consumer Defensive",
    "industry": "Household & Personal Products",
    "website": "https://www.beiersdorf.com",
    "description": "Beiersdorf Aktiengesellschaft, together with its subsidiaries, manufactures and distributes consumer goods in Europe, the United States, Africa, Asia, and Australia. It operates through two segments: Consumer Business and Tesa Business. The Consumer Business Segment offers skin and body care products. The Tesa Business segment provides adhesive tapes and self-adhesive solutions for industries, craft businesses, and consumers. This segment offers its system solutions to the automotive, consumer electronics, printing and packaging, and electrical systems sectors. It operates an online store. It offers its products under the NIVEA, Eucerin, Hansaplast, La Prairie, Chantecaille, Coppertone, Labello, 8x4, HIDROFUGAL, Florena, tesa, SKIN STORIES, GAMMON, Aquaphor, Elastoplast, and CURITAS brand names. Beiersdorf Aktiengesellschaft was founded in 1882 and is headquartered in Hamburg, Germany. Beiersdorf Aktiengesellschaft is a subsidiary of maxingvest ag.",
    "market_cap": 20745545728,
    "logo_url": "",
    "fifty_two_week_change": -0.28321624,
    "current_price": 92.94,
    "currency": "EUR"
  },
  {
    "ticker": "BMW.DE",
    "yf_ticker": "BMW.DE",
    "name": "Bayerische Motoren Werke Aktiengesellschaft",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "website": "https://www.bmwgroup.com",
    "description": "Bayerische Motoren Werke Aktiengesellschaft develops, manufactures, and sells automobiles and motorcycles, spare parts, and accessories worldwide. It operates through Automotive, Motorcycles, and Financial Services segments. The company offers automobiles under the BMW, MINI, and Rolls-Royce brands. It also develops, manufactures, and sells motorcycles for private use and special-purpose vehicles for operational use under the BMW Motorrad brand. In addition, the company provides car rentals; credit financing; leasing that include insurance and service products; financing for dealership and customer deposits; vehicle fleet financing services for corporate car fleets under the Alphabet brand; and financial services for the automotive sector. It sells its products through independent dealerships. Bayerische Motoren Werke Aktiengesellschaft was founded in 1916 and is headquartered in Munich, Germany.",
    "market_cap": 56384897024,
    "logo_url": "",
    "fifty_two_week_change": 0.23225641,
    "current_price": 92.5,
    "currency": "EUR"
  },
  {
    "ticker": "BNR.DE",
    "yf_ticker": "BNR.DE",
    "name": "Brenntag SE",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "website": "https://www.brenntag.com",
    "description": "Brenntag SE engages in the distribution of chemicals and ingredients in Germany, the United States, the United Kingdom, China, Canada, Italy, Poland, France, and internationally. It operates in two segments, Brenntag Essentials and Brenntag Specialties. The company provides just-in-time delivery, product mixing, blending, repackaging, inventory management, and drum return handling, as well as application, marketing and supply chain solutions, technical and formulation support, comprehensive regulatory know-how, and digital solutions, such as digital sales channels and product platforms. It serves customers in various industries, including nutrition, pharma, beauty and care, water treatment, and lubricants; and industrial markets, as well as coatings, adhesives, sealants and elastomers, and constructions, polymers, and rubber industries. The company was founded in 1874 and is headquartered in Essen, Germany.",
    "market_cap": 7108091904,
    "logo_url": "",
    "fifty_two_week_change": -0.13508773,
    "current_price": 49.23,
    "currency": "EUR"
  },
  {
    "ticker": "CBK.DE",
    "yf_ticker": "CBK.DE",
    "name": "Commerzbank AG",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "website": "https://www.commerzbank.com",
    "description": "Commerzbank AG provides banking and capital market products and services to private and small business customers, corporate, financial service providers, and institutional clients in Germany, rest of Europe, the Americas, Asia, and internationally. It operates through two segments, Private and Small-Business Customers, and Corporate Clients. The company offers saving, fixed deposit, checking, business, current, call money, and joint accounts; insurance products; credit and debit cards; pension; payment solutions; overdraft services; and various loans. It also offers instalment loans; real estate financing; corporate financing; financing advisory; merger and acquisition; foreign trade; trade financing; term deposits; and online banking services, as well as trades securities, such as shares, funds, ETFs, and bonds. In addition, the company provides wealth planning, asset management, estate and foundation management, asset risk analysis, and succession planning services. Commerzbank AG was founded in 1870 and is headquartered in Frankfurt am Main, Germany.",
    "market_cap": 40003563520,
    "logo_url": "",
    "fifty_two_week_change": 1.0786183,
    "current_price": 35.48,
    "currency": "EUR"
  },
  {
    "ticker": "CON.DE",
    "yf_ticker": "CON.DE",
    "name": "Continental Aktiengesellschaft",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "website": "https://www.continental.com",
    "description": "Continental Aktiengesellschaft manufactures tire and develops and produces solutions for automotive manufacturers, industrial, and end customers worldwide. It provides tires for cars, trucks, buses, two-wheel, and specialist vehicles, as well as digital tire monitoring and management systems; and engages in the retail of tires. The company also develops solutions for industrial applications made from rubber, plastic, metal, and textiles; hoses, conveyor belts, air springs, and drive belts; and surface materials for energy, mining, agriculture, construction, as well as interior and exterior design, and automotive sectors. In addition, it provides contract manufacturing services. The company was formerly known as Continental-Caoutchouc- und Gutta-Percha Compagnie. Continental Aktiengesellschaft was founded in 1871 and is headquartered in Hanover, Germany.",
    "market_cap": 13800413184,
    "logo_url": "",
    "fifty_two_week_change": 0.0690521,
    "current_price": 69.0,
    "currency": "EUR"
  },
  {
    "ticker": "DTG.DE",
    "yf_ticker": "DTG.DE",
    "name": "Daimler Truck Holding AG",
    "sector": "Industrials",
    "industry": "Farm & Heavy Construction Machinery",
    "website": "https://www.daimlertruck.com",
    "description": "Daimler Truck Holding AG manufactures and sells light, medium- and heavy-duty trucks and buses in Europe, North America, Asia, Latin America, and internationally. It operates through five segments: Trucks North America, Mercedes-Benz Trucks, Trucks Asia, Daimler Buses, and Financial Services. The company offers light, medium, and heavy-duty trucks; city and intercity buses, coaches, and bus chassis; industrial engines; and special vehicles used in various sector, as well as new and used commercial vehicles. It also provides various financial services, such as rental, leasing, and financing for vehicles; and charging infrastructure, insurance brokerage, payment, and integrated services for zero emission vehicles. In addition, the company offers connectivity solutions under the Detroit Connect, truckonnect, OMNIplus ON, Mercedes-Benz Uptime, and Fleetboard brands; and aftersales services, as well as sells spare parts. It provides trucks and buses under the Mercedes-Benz, Freightliner, Western Star, FUSO, BharatBenz, RIZON, Setra, and Thomas Built Buses brands. The company was founded in 1896 and is headquartered in Leinfelden-Echterdingen, Germany.",
    "market_cap": 30287810560,
    "logo_url": "",
    "fifty_two_week_change": 0.01449275,
    "current_price": 39.5,
    "currency": "EUR"
  },
  {
    "ticker": "DBK.DE",
    "yf_ticker": "DBK.DE",
    "name": "Deutsche Bank Aktiengesellschaft",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "website": "https://www.db.com",
    "description": "Deutsche Bank Aktiengesellschaft, a stock corporation, provides corporate and investment banking, private clients, and asset management products and services in Germany, the United Kingdom, rest of Europe, the Middle East, Africa, the Americas, and the Asia-Pacific. It operates through Corporate Bank, Investment Bank, Private Bank, and Asset Management segments. The Corporate Bank segment offers risk management solutions, cash management, trade finance and lending, trust and agency, and securities services. The Investment Bank segment provides debt origination, merger and acquisitions, foreign exchange, and equity advisory and origination platform services. The Private Bank segment offers payment and account services, and credit and deposit products, as well as investment advice products, such as environmental, social, and governance products. This segment also provides banking, wealth management, other financial, and postal and parcel services; and supports in planning, managing and investing wealth, financing personal and business interests, and servicing institutional and corporate needs. The Asset Management segment offers investment solutions, such as alternative investments, which include real estate, infrastructure, liquid real assets, and sustainable investments; and various other services, including insurance and pension solutions, asset liability management, portfolio management solutions, and asset allocation advisory to individuals and institutions. Deutsche Bank Aktiengesellschaft was founded in 1870 and is headquartered in Frankfurt am Main, Germany.",
    "market_cap": 63240159232,
    "logo_url": "",
    "fifty_two_week_change": 0.9260621,
    "current_price": 33.1,
    "currency": "EUR"
  },
  {
    "ticker": "DB1.DE",
    "yf_ticker": "DB1.DE",
    "name": "Deutsche Börse AG",
    "sector": "Financial Services",
    "industry": "Financial Data & Stock Exchanges",
    "website": "https://deutsche-boerse.com/dbg-de/",
    "description": "Deutsche Börse AG operates as an international exchange organization in Germany, rest of Europe, the United States, and the Asia-Pacific. It operates through four segments: Investment Management Solutions; Trading & Clearing; Fund Services; and Securities Services. The company offers investment management solutions that include indices and research, such as ISS solutions, STOXX and DAX indices, index licensing, customized indices, and index calculation services; software and analytics services; pre-IPO and listing, including market structure, growth financing, going and being public, private market, and statistics/circulars; and cash, spot, and derivatives market and foreign exchange services, as well as real time market data, analytics, historical market data, and reference data. It also operates in the cash market through Xetra, Börse Frankfurt, and Tradegate trading venues; and offers Eurex and European commodity clearing services. In addition, the company offers securities services, including issuance of securities, settlement, and asset services; clearstream fund centre, which provides fund processing services; and Kneip that provides fund data management and reporting solutions for the asset management industry. Further, it engages in the operation of third clearing house Nodal Clear; and specialized software as a service platform for trading participants; and API platform, as well as provision of information technology solutions, including financial market, commodities market, and network connectivity solutions under the Deutsche Börse and 7 Market Technology brands. The company was founded in 1585 and is headquartered in Frankfurt am Main, Germany.",
    "market_cap": 39512350720,
    "logo_url": "",
    "fifty_two_week_change": -0.0647136,
    "current_price": 215.0,
    "currency": "EUR"
  },
  {
    "ticker": "DHL.DE",
    "yf_ticker": "DHL.DE",
    "name": "Deutsche Post AG",
    "sector": "Industrials",
    "industry": "Integrated Freight & Logistics",
    "website": "https://group.dhl.com",
    "description": "Deutsche Post AG operates as a mail and logistics company in Germany, rest of Europe, the Americas, the Asia Pacific, the Middle East, and Africa. The company operates through five segments: Express; Global Forwarding, Freight; Supply Chain; eCommerce; and Post & Parcel Germany. The Express segment offers time-definite courier and express services to business and private customers. The Global Forwarding, Freight segment provides air, ocean, and overland freight forwarding services; and offers multimodal and sector-specific solutions. The Supply Chain segment delivers customized logistics services and supply chain solutions to its customers based on modular components, including warehousing and transport services, as well as value-added services. The eCommerce segment provides parcel delivery and non-time definite international cross-border services. The Post & Parcel Germany segment transports, sorts, and delivers documents and goods; and offers additional services, such as registered mail, insured items, redirection, and storage. Deutsche Post AG was incorporated in 1995 and is headquartered in Bonn, Germany.",
    "market_cap": 55423582208,
    "logo_url": "",
    "fifty_two_week_change": 0.42029417,
    "current_price": 48.06,
    "currency": "EUR"
  },
  {
    "ticker": "DTE.DE",
    "yf_ticker": "DTE.DE",
    "name": "Deutsche Telekom AG",
    "sector": "Communication Services",
    "industry": "Telecom Services",
    "website": "https://www.telekom.com",
    "description": "Deutsche Telekom AG, together with its subsidiaries, provides integrated telecommunication services worldwide. The company operates through Germany, United States, Europe, Systems Solutions, and Group Development segments. It offers fixed-network services, including voice and data communication services based on fixed-network and broadband technology; and sells terminal equipment and other hardware products, as well as services to resellers. The company also provides mobile voice and data services to consumers and business customers; sells mobile devices and other hardware products; and sells mobile services to resellers and to companies that buys and markets network services to third parties, such as mobile virtual network operators. In addition, it offers internet services; internet-based TV products and services; and information and communication technology systems for multinational corporations and public sector institutions with an infrastructure of data centers and network services. Further, the company provides wireless communications services; and cloud services, digital solutions, and security and advisory solutions. The company has mobile and broadband customers, as well as fixed-network lines. Deutsche Telekom AG was incorporated in 1995 and is headquartered in Bonn, Germany.",
    "market_cap": 140645875712,
    "logo_url": "",
    "fifty_two_week_change": -0.06698567,
    "current_price": 28.25,
    "currency": "EUR"
  },
  {
    "ticker": "EOAN.DE",
    "yf_ticker": "EOAN.DE",
    "name": "E.ON SE",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "website": "https://www.eon.com",
    "description": "E.ON SE operates as an energy company in Germany, the United Kingdom, Sweden, the Netherlands, rest of Europe, and internationally. It operates through Energy Networks, Energy Infrastructure Solutions, and Energy Retail segments. The Energy Networks segment operates power and gas distribution networks; and offers maintenance, repair, and related services for its power and gas networks. Its Energy Infrastructure Solutions provides integrated and sustainable energy solutions for cities, municipalities, and industrial and commercial customers comprising district heating and cooling; heat, steam, and power generation services; embedded solutions; products and services that enhance energy efficiency; and software-based applications. This segment also installs smart energy meters, block-type thermal power stations, photovoltaic systems, air-conditioning systems, and heat pumps. Its Energy Retail segment distributes power and gas; installs customer connections and connects renewable energy generating stations to the grid; and offers a range of green power and green gas tariffs, and sustainable solutions that enhance energy efficiency for residential, small and medium-sized enterprises, large commercial and industrial, and sales partners. The company also provides customers digital solutions; biogas and biomethane products; and compressed natural gas refueling services, as well as installs solar and battery storage systems, heating systems, and electric vehicle charging points. E.ON SE was founded in 1923 and is headquartered in Essen, Germany.",
    "market_cap": 44030365696,
    "logo_url": "",
    "fifty_two_week_change": 0.50972414,
    "current_price": 16.85,
    "currency": "EUR"
  },
  {
    "ticker": "FRE.DE",
    "yf_ticker": "FRE.DE",
    "name": "Fresenius SE & Co. KGaA",
    "sector": "Healthcare",
    "industry": "Medical Care Facilities",
    "website": "https://www.fresenius.com",
    "description": "Fresenius SE & Co. KGaA, a health care company, provides products and services for chronically ill patients. It operates through Fresenius Kabi and Fresenius Helios segment. The Fresenius Kabi segment engages in the therapy and care of critically and chronically ill patients; enteral and parenteral nutrition products; medical technologies, as well as disposables, infusions pumps, apheresis machines, cell therapy devices, and other products. The Fresenius Helios segment provides clinical and nursing care facilities. The company was formerly known as Fresenius SE and changed its name to Fresenius SE & Co. KGaA in January 2011. Fresenius SE & Co. KGaA was founded in 1912 and is based in Bad Homburg vor der Höhe, Germany.",
    "market_cap": 28021053440,
    "logo_url": "",
    "fifty_two_week_change": 0.39635015,
    "current_price": 49.75,
    "currency": "EUR"
  },
  {
    "ticker": "FME.DE",
    "yf_ticker": "FME.DE",
    "name": "Fresenius Medical Care AG",
    "sector": "Healthcare",
    "industry": "Medical Care Facilities",
    "website": "https://www.freseniusmedicalcare.com",
    "description": "Fresenius Medical Care AG provides dialysis and related services for individuals with renal diseases in Germany, the United States, and internationally. The company offers dialysis treatment and related laboratory and diagnostic services through a network of outpatient dialysis clinics; materials, training, and patient support services comprising clinical monitoring, follow-up assistance, and arranging for delivery of the supplies to the patient's residence; and dialysis services under contract to hospitals in the United States for the hospitalized end-stage renal disease (ESRD) patients and for patients suffering from acute kidney failure. The company operates through Care Delivery and Care Enablement segments. It also develops, manufactures, and distributes various health care products, including hemodialysis machines, peritoneal dialysis cyclers, peritoneal dialysis solutions, hemodialysis concentrates, solutions and granulates, bloodlines, renal pharmaceuticals, systems for water treatment, and acute cardiopulmonary and apheresis products. In addition, the company develops, acquires, and in-licenses renal pharmaceuticals; offers renal medications and supplies to patients at homes or to dialysis clinics; and provides vascular specialty, ambulatory surgery center, physician nephrology practice management, ambulant treatment, pharmacy and other services. The company sells its products to dialysis clinics, hospitals, and specialized treatment clinics, as well as through local sales forces, independent distributors, dealers, and sales agents. Fresenius Medical Care AG was incorporated in 1996 and is headquartered in Bad Homburg, Germany.",
    "market_cap": 11446057984,
    "logo_url": "",
    "fifty_two_week_change": -0.10075742,
    "current_price": 39.01,
    "currency": "EUR"
  },
  {
    "ticker": "G1A.DE",
    "yf_ticker": "G1A.DE",
    "name": "GEA Group Aktiengesellschaft",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.gea.com",
    "description": "GEA Group Aktiengesellschaft produces and supplies systems and components to the food, beverage, and pharmaceutical industries worldwide. It operates through Separation & Flow Technologies; Liquid & Power Technologies; Food & Health Technologies; Farm Technologies; and Heating & Refrigeration Technologies segments. The company manufacture process-related components and machinery, notably separators, decanters, homogenizers, valves, and pumps; and process solutions, including brewing systems, liquid processing and filling, concentration, fermentation, crystallization, purification, drying, powder handling, and packaging, as well as systems for carbon capture and emission control for dairy, new-food, beverage, food, chemical, and other industries. It also prepares, marinates, and processes meat, poultry, seafood, vegan products, and snack and pasta, as well as slicing, packaging lines, freeze drying, granulators, and tablet presses for pharmaceutical industry. In addition, the company offers customer solution for milk production and livestock farming comprising automatic milking and feeding system, conventional milking solutions, manure handling, and digital herd management tools; and energy solutions in the field of industrial refrigeration and heating for various industries, including food, beverage, dairy, oil and gas, supporting automation, digital, and service platform. The company was formerly known as mg technologies ag and changed its name to GEA Group Aktiengesellschaft in 2005. GEA Group Aktiengesellschaft was founded in 1881 and is headquartered in Düsseldorf, Germany.",
    "market_cap": 9662278656,
    "logo_url": "",
    "fifty_two_week_change": 0.19387758,
    "current_price": 59.35,
    "currency": "EUR"
  },
  {
    "ticker": "HNR1.DE",
    "yf_ticker": "HNR1.DE",
    "name": "Hannover Rück SE",
    "sector": "Financial Services",
    "industry": "Insurance - Reinsurance",
    "website": "https://www.hannover-re.com",
    "description": "Hannover Rück SE, together with its subsidiaries, provides reinsurance products and services in Germany, the United Kingdom, France, Europe, the United States, Asia, Australia, Africa, and internationally. It operates through Property & Casualty Reinsurance; and Life & Health Reinsurance segments. The company provides property and casualty reinsurance solutions for agricultural, livestock, and bloodstock; aviation and space; natural catastrophe; credit, surety, and political risks; cyber; facultative; and marine and offshore energy businesses, as well as insurance-linked securities and structured reinsurance. It also offers risk solutions in the areas of critical illness, disability, health, longevity, long term care, and mortality. In addition, the company offers group life, retirement, lifestyle, credit life, and Takaful reinsurance products. Further, the company provides various financial solutions, including new-business financing; monetization of embedded value; reserve and solvency relief; and reinsurance and solvency II businesses. The company was formerly known as Hannover Rückversicherung AG and changed its name to Hannover Rück SE in March 2013. Hannover Rück SE was founded in 1966 and is based in Hanover, Germany. Hannover Rück SE operates as a subsidiary of Talanx AG.",
    "market_cap": 30173403136,
    "logo_url": "",
    "fifty_two_week_change": -0.027090669,
    "current_price": 250.2,
    "currency": "EUR"
  },
  {
    "ticker": "HEI.DE",
    "yf_ticker": "HEI.DE",
    "name": "Heidelberg Materials AG",
    "sector": "Basic Materials",
    "industry": "Building Materials",
    "website": "https://www.heidelbergmaterials.de",
    "description": "Heidelberg Materials AG, together with its subsidiaries, produces and distributes cement, aggregates, ready-mixed concrete, and asphalt worldwide. It provides cement products; natural stone aggregates, including sand and gravel; crushed aggregates comprising stone chippings and crushed stones; and ready-mixed concrete for use in the construction of tunnels or bridges, office buildings, or schools, as well as to produce precast concrete parts, such as stairs, ceiling elements, or structural components. The company offers asphalt; and trades in cement, clinker, secondary cementitious materials, solid, alternative fuels, other building materials, and additives. The company was formerly known as HeidelbergCement AG and changed its name to Heidelberg Materials AG in May 2023. Heidelberg Materials AG was founded in 1873 and is headquartered in Heidelberg, Germany.",
    "market_cap": 41378091008,
    "logo_url": "",
    "fifty_two_week_change": 0.7957747,
    "current_price": 231.9,
    "currency": "EUR"
  },
  {
    "ticker": "HEN3.DE",
    "yf_ticker": "HEN3.DE",
    "name": "Henkel AG & Co. KGaA",
    "sector": "Consumer Defensive",
    "industry": "Household & Personal Products",
    "website": "https://www.henkel.com",
    "description": "Henkel AG & Co. KGaA, together with its subsidiaries, engages in the adhesive technologies and consumer brands businesses in Europe, India, the Middle East, Africa, North America, Latin America, the Asia Pacific. The company offers adhesives, sealants, and functional coatings for various business areas, including packaging and consumer goods; mobility and electronics; and craftsmen, construction, and professional industries. It also provides hair styling, hair colorants, and hair care products; and body care products, as well as distributes its products through brick-and-mortar stores, hair salons, and digital channels. In addition, the company offers laundry and home care products, such as heavy-duty and specialty detergents, fabric softeners and laundry additives, and other fabric cleaning and fabric care products; dishwashing products; and hard surface and toilet cleaners. Further, it provides household cleaners products. The company was founded in 1876 and is headquartered in Düsseldorf, Germany.",
    "market_cap": 29229514752,
    "logo_url": "",
    "fifty_two_week_change": -0.18947619,
    "current_price": 69.7,
    "currency": "EUR"
  },
  {
    "ticker": "IFX.DE",
    "yf_ticker": "IFX.DE",
    "name": "Infineon Technologies AG",
    "sector": "Technology",
    "industry": "Semiconductors",
    "website": "https://www.infineon.com",
    "description": "Infineon Technologies AG develops, manufactures, and markets semiconductors and semiconductor-based solutions in Germany, Europe, the Middle East, Africa, Mainland China, Hong Kong, Taiwan, the Asia-Pacific, Japan, the United States, and the Americas. The Automotive segment offers automotive and industrial microcontrollers; analog and memory ICs; ethernet; power diodes and modules; power switches; sensors; transceivers; and voltage regulators for assistance and safety systems, comfort electronics, infotainment, powertrain, and security applications. Its Green Industrial Power segment provides discrete and bare die IGBTs; IGBT modules; and SiC discretes and modules for air conditioning technology, energy generation and storage, energy transmission, home appliances, industrial drives, industrial power supplies and vehicles, and traction applications. The Power & Sensor Systems segment offers 3D ToF sensors; chips for gas and pressure sensors, and MEMS microphones; control ICs; customized chips; discrete low-, mid-, and high-voltage power MOSFETs; ESD protection diodes; GaN power switches; GPS low-noise amplifiers; low- and high-voltage driver ICs; radar sensor ICs; RF antenna switches and power transistors; SiC diode and MOSFETs; and USB controllers for audio amplifiers, automotive electronics, BLDC motors, cellular communications infrastructure, charging stations for electric vehicles, human machine interaction, IoT, LED and conventional lighting systems, microinverters, mobile devices, power management, and harsh environment applications. Its Connected Secure Systems segment provides connectivity solutions, embedded security controllers, microcontrollers, and security controllers for authentication, automotive, consumer electronics, government identification document, IoT, mobile communication, payment system, ticketing, access control, and trusted computing applications. Infineon Technologies AG was founded in 1952 and is headquartered in Neubiberg, Germany.",
    "market_cap": 52886409216,
    "logo_url": "",
    "fifty_two_week_change": 0.30529737,
    "current_price": 40.615,
    "currency": "EUR"
  },
  {
    "ticker": "MBG.DE",
    "yf_ticker": "MBG.DE",
    "name": "Mercedes-Benz Group AG",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "website": "https://group.mercedes-benz.com",
    "description": "Mercedes-Benz Group AG operates as an automotive company in Germany and internationally. It operates through Mercedes-Benz Cars, Mercedes-Benz Vans, and Mercedes-Benz Mobility segments. The company develops, manufactures, and sells cars and vans under the Mercedes-Benz, Mercedes-AMG, Mercedes-Maybach, G-Class brands, as well as related spare parts and accessories. It also provides financing, leasing, vehicle subscription and rental, fleet management, insurance brokerage, and mobility services, as well as digital services for charging and payment. The company was formerly known as Daimler AG and changed its name to Mercedes-Benz Group AG in February 2022. Mercedes-Benz Group AG was founded in 1886 and is headquartered in Stuttgart, Germany.",
    "market_cap": 57485348864,
    "logo_url": "",
    "fifty_two_week_change": 0.13758016,
    "current_price": 59.7,
    "currency": "EUR"
  },
  {
    "ticker": "MRK.DE",
    "yf_ticker": "MRK.DE",
    "name": "Merck KGaA",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "website": "https://www.emdgroup.com",
    "description": "Merck KGaA operates as a science and technology company in Germany and internationally. It operates through Life Science, Healthcare, and Electronics segments. The Life Science segment offers tools, chemicals, and equipment for academic labs, biotech, and pharmaceutical manufacturers, as well as the industrial sector. This segment offers science and lab solutions comprising reagents, consumables, devices, instruments, software, and services for research, production, and testing; process solutions consisting of filtration devices, chromatography resins, single-use systems, process chemicals, and excipients; and life science services, such as monoclonal antibodies, high-potency active pharmaceutical ingredients, antibody-drug conjugates, and viral and gene therapy products, as well as contract development, manufacturing, and testing services. Its Healthcare segment discovers, develops, manufactures, and markets prescription drugs and biopharmaceuticals for the treatment of oncology, neurology and immunology, fertility, cardiovascular, metabolism, and endocrinology disorders; and provides general medicines, injection devices, and disease monitoring software. The Electronics segment supplies materials comprising thin films, patterning and planarization formulations, specialty gases, optronics, and optical metrology equipment for the semiconductor and display industries, as well as provides delivery systems and services. It has in-licensing agreements with Jiangsu Hengrui Pharmaceuticals Co. Ltd. for developing, manufacturing, and commercializing drug candidates for the treatment of metastatic colorectal cancer; and Abbisko Therapeutics Co. Ltd. for developing and commercializing of drug candidates for the treatment of tenosynovial giant cell tumor. The company was founded in 1668 and is headquartered in Darmstadt, Germany. Merck KGaA is a subsidiary of E. Merck KG.",
    "market_cap": 55521136640,
    "logo_url": "",
    "fifty_two_week_change": -0.103169024,
    "current_price": 127.7,
    "currency": "EUR"
  },
  {
    "ticker": "MTX.DE",
    "yf_ticker": "MTX.DE",
    "name": "MTU Aero Engines AG",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "website": "https://www.mtu.de",
    "description": "MTU Aero Engines AG, together with its subsidiaries, engages in the development, manufacture, marketing, and maintenance of commercial and military aircraft engines, and aero-derivative industrial gas turbines in Germany, other European countries, North America, Asia, and internationally. It operates through two segments: Original Equipment Manufacturing Business; and Maintenance, Repair, and Overhaul Business. The company offers commercial aircraft engines for wide body aircraft, narrow body, regional jets, business jets, and turboprops; military aircraft engines for fighter jets, helicopters, and transporters; and industrial gas turbines. It also maintains, repairs, and overhauls commercial and military engines; and manufactures and markets various spare parts. The company was formerly known as MTU Aero Engines Holding AG and changed its name to MTU Aero Engines AG in May 2013. MTU Aero Engines AG was founded in 1913 and is headquartered in Munich, Germany.",
    "market_cap": 21030031360,
    "logo_url": "",
    "fifty_two_week_change": 0.2267785,
    "current_price": 391.0,
    "currency": "EUR"
  },
  {
    "ticker": "MUV2.DE",
    "yf_ticker": "MUV2.DE",
    "name": "Münchener Rückversicherungs-Gesellschaft Aktiengesellschaft in München",
    "sector": "Financial Services",
    "industry": "Insurance - Reinsurance",
    "website": "https://www.munichre.com",
    "description": "Münchener Rückversicherungs-Gesellschaft Aktiengesellschaft in München engages in the insurance and reinsurance businesses worldwide. It operates through five segments: Life and Health Reinsurance, Property-Casualty Reinsurance, ERGO Life and Health Germany, ERGO Property-Casualty Germany, and ERGO International. The company offers life and health reinsurance solutions, such as digital underwriting and advanced analytics solutions, health insurance management system, financial market risks, financing, portfolio risk management, digitalized investment-linked solution, data analytics, underwriting and claims, medical research, capital management, and health market, as well as MIRA digital suite that includes MIRA PoS, MIRApply insured and physician, claims risk assessment, and CLARA plus. It also provides property and casualty reinsurance solutions, including agricultural reinsurance; business advisory, personal lines, portfolio management, insurance consulting, commercial motor, telematics, electric vehicle insurance, and SiTao consulting; infrastructure risk; property insurance, location risk, insurance linked securities, and NatCatSERVICE for natural catastrophe loss database; specialty reinsurance; prospective structured and retroactive reinsurance; risk transfer; cyber; and data analytics, REALYTIX ZERO, and cert2go. In addition, the company offers solutions for industry clients, such as corporate risk, new tech, green tech, parametric, and aviation and space solutions, as well as risk services. Further, it provides life, property-casualty, health, legal protection, and travel insurance products under the ERGO brand; and insurance solutions for agriculture, captive, epidemic, cyber, and renewable energy sectors. The company was founded in 1880 and is based in Munich, Germany.",
    "market_cap": 69566562304,
    "logo_url": "",
    "fifty_two_week_change": 0.06839335,
    "current_price": 529.4,
    "currency": "EUR"
  },
  {
    "ticker": "PAH3.DE",
    "yf_ticker": "PAH3.DE",
    "name": "Porsche Automobil Holding SE",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "website": "https://www.porsche-se.com",
    "description": "Porsche Automobil Holding SE, through its subsidiaries, operates as an automobile manufacturer worldwide. The company operates in two segments, Core Investments and Portfolio Investments. It is involved in investments in the areas of mobility and industrial technology. The company offers its products under the Volkswagen, Audi, SEAT, \u008aKODA, Bentley, Lamborghini, and Porsche brand names. The company was formerly known as Dr. Ing. h.c. F. Porsche Aktiengesellschaft and changed its name to Porsche Automobil Holding SE in November 2007. Porsche Automobil Holding SE was incorporated in 2007 and is headquartered in Stuttgart, Germany.",
    "market_cap": 11830436864,
    "logo_url": "",
    "fifty_two_week_change": 0.086236,
    "current_price": 38.63,
    "currency": "EUR"
  },
  {
    "ticker": "QIA.DE",
    "yf_ticker": "QIA.DE",
    "name": "Qiagen N.V.",
    "sector": "Healthcare",
    "industry": "Diagnostics & Research",
    "website": "https://www.qiagen.com",
    "description": "Qiagen N.V. provides sample to insight solutions that transform biological samples into molecular insights in the Netherlands and internationally. The company offers primary sample technology consumables, such as nucleic acid stabilization and purification kits for sample materials, manual and automated processing for genotyping, gene expression, and viral and bacterial analysis, as well as silica membranes and magnetic bead technologies; secondary sample technology consumables, such as kits and components for purification of nucleic acids; and instruments for nucleic acid purification, quality control, and accessories. It also provides Immune response consumables, such as interferon-gamma release assay for TB testing, and assays for post-transplant testing and viral load monitoring; oncology and sexual and reproductive health consumables, such as assays for prenatal testing and detection of sexually transmitted diseases and HPV; assays for analysis of genomic variants; and sample to insight instruments, including one-step molecular analysis of hard-to-diagnose syndromes, and integrated PCR testing. The company offers research PCR consumables, such as quantitative PCR, reverse transcription, and combinations kits for analysis of gene expression, genotyping and gene regulation, and running on QIAGEN instruments and technologies; human ID/forensics assay consumables, such as short tandem repeat assays for human ID, and assays for food contamination; PCR instruments, including digital PCR and qPCR solutions; and developed and configured enzymes and PCR solutions. It offers NGS gene panels, library prep kits and components, and whole genome amplification; QIAGEN consumables and instruments; bioinformatics solutions; and custom laboratory and genomic services. The company provides software-as-a-service. It serves molecular diagnostics, academia, pharmaceutical, and applied testing customers. The company was founded in 1984 and is headquartered in Venlo, the Netherlands.",
    "market_cap": 8953364480,
    "logo_url": "",
    "fifty_two_week_change": -0.114471376,
    "current_price": 41.29,
    "currency": "EUR"
  },
  {
    "ticker": "RHM.DE",
    "yf_ticker": "RHM.DE",
    "name": "Rheinmetall AG",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "website": "https://www.rheinmetall.com",
    "description": "Rheinmetall AG provides mobility and security technologies in Germany, Rest of Europe, North, Middle, and South America, Asia and the Near East, and internationally. It operates through the Vehicle Systems, Weapon and Ammunition, Electronic Solutions, Power Systems, and Others segments. The Vehicle Systems segment offers combat, logistics, support, and special vehicles, including armored tracked vehicles, CBRN protection systems, artillery, turret systems, and wheeled logistics and tactical vehicles. The Weapon and Ammunition segment provides firepower and protection solutions, such as weapons and ammunition, protection systems, propellants, and international projects and services. The Electronic Solutions segment offers a chain of systems network, such as sensors, networking platforms, automated connected effectors for soldiers, cyberspace protection solutions, and training and simulation solutions. Its products include air defense, soldier, and fire control systems; radar technology; and command, control and reconnaissance systems, as well as simulations for the army, air force, navy, and civil applications. The Power Systems segment offers mobility solutions, control technologies, and digital applications for the automotive and energy industry, including air management, thermal management, e-mobility and digitization, hydrogen technology, metallic plain bearings, composite materials and lightweight construction. Its products include emissions reduction; actuators; solenoid valves; water, oil, and vacuum pumps; engine blocks, structural components, and cylinder heads; plain bearings and bushes; and global replacement parts. It also engages in the aftermarket activities. The company was formerly known as Rheinmetall Berlin AG and changed its name to Rheinmetall AG in 1996. Rheinmetall AG was founded in 1889 and is headquartered in Düsseldorf, Germany.",
    "market_cap": 82173812736,
    "logo_url": "",
    "fifty_two_week_change": 1.8111522,
    "current_price": 1841.5,
    "currency": "EUR"
  },
  {
    "ticker": "RWE.DE",
    "yf_ticker": "RWE.DE",
    "name": "RWE Aktiengesellschaft",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "website": "https://www.rwe.com",
    "description": "RWE Aktiengesellschaft generates and supplies electricity from renewable and conventional sources in Germany, the United Kingdom, rest of Europe, North America, and internationally. The company operates through five segments: Offshore Wind; Onshore Wind/Solar; Flexible Generation; Supply & Trading; and Phaseout Technologies. It generates wind, hydro, solar, gas, lignite, and biomass electricity. The company also trades in electricity, gas, and energy commodities; operates gas storage facilities; and engages in battery storage activities, as well as lignite mining and refining. It serves commercial, industrial, and municipal customers. The company was founded in 1898 and is headquartered in Essen, Germany.",
    "market_cap": 35342974976,
    "logo_url": "",
    "fifty_two_week_change": 0.6807989,
    "current_price": 47.8,
    "currency": "EUR"
  },
  {
    "ticker": "SAP.DE",
    "yf_ticker": "SAP.DE",
    "name": "SAP SE",
    "sector": "Technology",
    "industry": "Software - Application",
    "website": "https://www.sap.com",
    "description": "SAP SE, together with its subsidiaries, provides enterprise application and business solutions worldwide. It offers SAP S/4HANA that provides software capabilities for finance, risk and project management, procurement, manufacturing, supply chain and asset management, and research and development; SAP SuccessFactors solutions for human resources, including HR, time, payroll, talent and employee experience management, and analytics and planning; and spend management solutions that covers direct and indirect spend, travel and expense, and external workforce management. The company also provides SAP customer experience solutions; SAP Business Technology platform that enables customers and partners to build, integrate, and automate applications; and SAP Business Network, a business-to-business collaboration platform that helps digitalize key business processes across the supply chain and enables communication between trading partners. In addition, it offers SAP Signavio to help customers to discover, analyze, and understand their business process operations; industry solutions that provides customers and partners with industry-specific solutions; and SAP LeanIX to visualize their as-is enterprise architecture, assess interdependencies and the potential impact of IT modernization, and manage the transition toward the target landscape with established practices and a detailed roadmap. Further, the company provides WalkMe to execute workflows across various number of applications; SAP Enable Now, which offers e-learning content embedded in SAP workflows; Taulia solutions for working capital management to help businesses create and deliver the right cash flow strategy, and the flexibility to adjust it to meet liquidity challenges; and sustainability solutions and services. Additionally, it provides services and support solutions. SAP SE was founded in 1972 and is headquartered in Walldorf, Germany.",
    "market_cap": 240781934592,
    "logo_url": "",
    "fifty_two_week_change": -0.14990824,
    "current_price": 206.75,
    "currency": "EUR"
  },
  {
    "ticker": "G24.DE",
    "yf_ticker": "G24.DE",
    "name": "Scout24 SE",
    "sector": "Communication Services",
    "industry": "Internet Content & Information",
    "website": "https://www.scout24.com",
    "description": "Scout24 SE operates ImmoScout24, a digital platform for the residential and commercial real estate sectors in Germany and internationally. The company operates through Professional and Private segments. It offers Pay-per-ad, a placement of property listings, and Realtor Lead Engine (RLE) for selling real estate; Mortgage Lead Engine; CRM software solutions for real estate agents; and ESG energy performance certificates. In addition, the company provides software solutions for real estate valuations, such as viewings and appraisals services; an automated valuation model, a product for the automated valuation of real estate through application programming interfaces; provision of transaction-related documents for real estate professionals; and training courses, digital training, and education software. Further, it offers TenantPlus and BuyerPlus, which offers opportunity analysis and a digital document folder; LivingPlus for tenant protection coverage and support; and LettingPlus, a cloud-based software solution to supports private landlords in rental and property management. It offers its products under the ImmoScout24, FLOWFACT, Vermietet.de, immoverkauf24, Propstack, BaufiTeam, SPRENGNETTER, Wohnungsboerse, bulwiengesa, EXPLOREAL, neubau kompass, and ENERGIE AUSWEIS 48 brands. The company serves residential and business real estate agents, appraisers, financing intermediaries and banks, consumers, homeowners, advertisers, and commercial service providers. The company was formerly known as Scout24 AG and changed its name to Scout24 SE in October 2021. Scout24 SE was founded in 1998 and is based in Berlin, Germany.",
    "market_cap": 6105687552,
    "logo_url": "",
    "fifty_two_week_change": -0.05672151,
    "current_price": 84.1,
    "currency": "EUR"
  },
  {
    "ticker": "SIE.DE",
    "yf_ticker": "SIE.DE",
    "name": "Siemens Aktiengesellschaft",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.siemens.com",
    "description": "Siemens Aktiengesellschaft, a technology company, focuses in the areas of automation and digitalization in Europe, Commonwealth of Independent States, Africa, the Middle East, the Americas, Asia, and Australia. It operates through Digital Industries, Smart Infrastructure, Mobility, Siemens Healthineers, and Siemens Financial Services (SFS) segments. The Digital Industries segment provides automation systems and software for factories, numerical control systems, servo motors, drives and inverters, and integrated automation systems for machine tools and production machines; process control systems, machine-to-machine communication products, sensors and radio frequency identification systems; production and product lifecycle management software, and simulation and testing of mechatronic system. The Smart Infrastructure segment offers products, systems, solutions, services, and software to support sustainable transition from fossil and renewable energy  sources; sustainable buildings and communities; and buildings, electrification, and electrical products. The Mobility segment provides rail passenger and freight transportation, such as metro systems, trams and light rail, and commuter trains, as well as trains and passenger coaches; locomotives and solutions for automated transportation and leasing; products and solutions for rail automation and electrification; maintenance and digital services; and digital and cloud-based solutions, and related services. The Siemens Healthineers segment develops, manufactures, and sells various diagnostic and therapeutic products and services; and provides clinical consulting and training services. The Siemens Financial Services segment offers debt and equity investments; leasing, lending, and working capital; structured, equipment, and project financing; and financial advisory services. The company was founded in 1847 and is headquartered in Munich, Germany.",
    "market_cap": 196587585536,
    "logo_url": "",
    "fifty_two_week_change": 0.3034079,
    "current_price": 251.0,
    "currency": "EUR"
  },
  {
    "ticker": "ENR.DE",
    "yf_ticker": "ENR.DE",
    "name": "Siemens Energy AG",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.siemens-energy.com",
    "description": "Siemens Energy AG operates as an energy technology company worldwide. It operates through Gas Services, Grid Technologies, Transformation of Industry, and Siemens Gamesa segments. The company provides gas and steam turbines, generators, and heat pumps, as well as performance enhancement, maintenance, digitalization, and consulting services for central and distributed power generation; and high voltage direct current transmission systems, offshore wind farm grid connections, transformers, flexible alternating current transmission systems, high voltage substations, air and gas-insulated switchgears, circuit breakers, capacitor, digital grid solutions and components, components and cyber security, and transformers and storage solutions. It also offers electrolyzers, industrial steam turbines, industrial generators, turbo and reciprocating compressors, drive systems and solutions, batteries and fuel cells, and other systems and solutions, as well as service and digital offerings; onshore and onshore wind turbines; design, engineering, manufacturing, and installation solutions for onshore markets; offshore wind turbine equipment design, manufacturing, and installation solutions; and management, operation and maintenance services for wind farms. The company serves utilities, independent power producers, project developers, municipal energy producers, engineering, procurement, and construction companies, oil and gas, transmission and distribution system operators, and industrial and infrastructure customers. Siemens Energy AG was founded in 1866 and is based in Munich, Germany.",
    "market_cap": 106319282176,
    "logo_url": "",
    "fifty_two_week_change": 1.4932563,
    "current_price": 124.3,
    "currency": "EUR"
  },
  {
    "ticker": "SHL.DE",
    "yf_ticker": "SHL.DE",
    "name": "Siemens Healthineers AG",
    "sector": "Healthcare",
    "industry": "Medical Devices",
    "website": "https://www.siemens-healthineers.com",
    "description": "Siemens Healthineers AG, through its subsidiaries, develops, manufactures, and sells a range of diagnostic and therapeutic products and services to healthcare providers in Germany, the United States, rest of Europe, CIS, Africa, the Middle East, the Americas, the Asia Pacific, Japan, and China. It operates in four segments: Imaging, Diagnostics, Varian, and Advanced Therapies. The Imaging segment offers magnetic resonance imaging, computed tomography, X-ray, molecular imaging, and ultrasound systems; and software solutions to support the reading and structured reporting of diagnostic images from different modalities. Its Diagnostics segment provides in-vitro diagnostic products and services to healthcare providers in the fields of general and specialty laboratory, and point-of-care diagnostics; and workflow solutions for laboratories and informatics products. The Varian segment offers microwave, cryoablation, and embolization technologies, as well as clinical professional services for cancer care that support oncology departments in hospitals and clinics; and customized support for cancer care operations. Its Advanced Therapies segment provides products that are designed to support image-guided minimally invasive clinical procedures in various areas, such as cardiology, neurology, and oncology; angiography systems and mobile C-arms; and AI-powered clinical applications. It also offers essential technical customer service, such as maintenance and repair; spare parts; medical equipment performance management; training; clinical education and e-learning; planning and design; financing; asset management; and managed departmental services for laboratories and healthcare facilities, as well as healthcare consulting, products, and services. The company was founded in 1896 and is headquartered in Forchheim, Germany. Siemens Healthineers AG is a subsidiary of Siemens Aktiengesellschaft.",
    "market_cap": 52185985024,
    "logo_url": "",
    "fifty_two_week_change": -0.09302783,
    "current_price": 46.53,
    "currency": "EUR"
  },
  {
    "ticker": "SY1.DE",
    "yf_ticker": "SY1.DE",
    "name": "Symrise AG",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "website": "https://www.symrise.com",
    "description": "Symrise AG operates as a supplier of fragrances, flavorings, cosmetic base materials and active ingredients, and functional ingredients and solutions in Europe, Africa, the Middle East, North America, the Asia Pacific, and Latin America. The company operates in two segments, Taste, Nutrition & Health; and Scent & Care. The Taste, Nutrition & Health segment provides functional ingredients and product solutions used in the production of food and beverages; savory flavors; natural and sustainable ingredients for food and beverage manufacturers, baby food, and dietary supplements; product solutions and services for pet food manufacturers; sustainable ingredients and services for fish feed manufacturers to develop solutions for fish and shrimp farms; and probiotics for food supplements and functional foods. The Scent & Care segment develops, produces, and sells fragrance ingredients and compositions, aroma molecules, cosmetic ingredients, and mint flavors, as well as specific application processes for such substances. This segment's products are used by manufacturers of perfumes, personal care and cosmetic products, cleaning products, detergents, air fresheners, and oral care products. The company was founded in 1874 and is headquartered in Holzminden, Germany.",
    "market_cap": 9708566528,
    "logo_url": "",
    "fifty_two_week_change": -0.30511212,
    "current_price": 69.46,
    "currency": "EUR"
  },
  {
    "ticker": "VOW3.DE",
    "yf_ticker": "VOW3.DE",
    "name": "Volkswagen AG",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "website": "https://www.volkswagen-group.com",
    "description": "Volkswagen AG manufactures and sells automobiles in Germany, other European countries, North America, South America, the Asia-Pacific, and internationally. It operates through four segments: Passenger Cars and Light Commercial Vehicles, Commercial Vehicles, Power Engineering, and Financial Services. The Passenger Cars and Light Commercial Vehicles segment engages in the development of vehicles, engines, motors, vehicle software, and batteries; produces and sells passenger cars and light commercial vehicles, and related parts; and offers motorcycles. The Commercial Vehicles segment develops vehicles, engines, motors, vehicle; develops, produces, and sells trucks and buses; and offers parts and related services. The Power Engineering segment offers large-bore diesel engines, turbomachinery, and propulsion components. The Financial Services segment provides dealership and customer financing, leasing, direct banking and insurance, fleet management, and mobility services. The company sells its products under the Volkswagen Passenger Cars, \u008akoda, SEAT/CUPRA, Volkswagen Commercial Vehicles, Audi, Lamborghini, Bentley, Ducati, Porsche, Scania, MAN, Volkswagen Truck & Bus, International commercial vehicles, TRATON, and Bugatti Rimac brands. Volkswagen AG was founded in 1937 and is headquartered in Wolfsburg, Germany. Volkswagen AG is a subsidiary of Porsche Automobil Holding SE.",
    "market_cap": 51819667456,
    "logo_url": "",
    "fifty_two_week_change": 0.1393534,
    "current_price": 101.65,
    "currency": "EUR"
  },
  {
    "ticker": "VNA.DE",
    "yf_ticker": "VNA.DE",
    "name": "Vonovia SE",
    "sector": "Real Estate",
    "industry": "Real Estate Services",
    "website": "https://www.vonovia.de",
    "description": "Vonovia SE operates as an integrated residential real estate company in Europe. It operates through four segments: Rental, Value-Add, Recurring Sales, and Development. The company offers property management services; property-related services; and value-added services, including maintenance and modernization of residential properties, craftsmen and residential environment organization, condominium administration, cable TV, metering, energy supply, and insurances services. It also involved in the sale of individual condominiums and single-family houses; and project development activities to build new homes. In addition, the company engages in the sale of projects to investors, construction of rental apartments, and construction of new properties on existing land held in the portfolio. Further, it provides My Vonovia, a mobile application to organize service requests and appointments, track the status of requests online in real time, and view all Vonovia documents. The company was formerly known as Deutsche Annington Immobilien SE and changed its name to Vonovia SE in August 2015. Vonovia SE was founded in 1998 and is headquartered in Bochum, Germany.",
    "market_cap": 21506332672,
    "logo_url": "",
    "fifty_two_week_change": -0.097142875,
    "current_price": 25.58,
    "currency": "EUR"
  },
  {
    "ticker": "ZAL.DE",
    "yf_ticker": "ZAL.DE",
    "name": "Zalando SE",
    "sector": "Consumer Cyclical",
    "industry": "Internet Retail",
    "website": "https://corporate.zalando.com",
    "description": "Zalando SE operates an online platform for fashion and lifestyle products in Germany and internationally. The company operates through Business-to-Business and Business-to-Consumer segments. It engages in the development, sourcing, marketing, retail, and commission sale of various type of goods, including shoes, apparel, accessories, and beauty products with free delivery and returns, as well as various payment options. The company also sells its products through Lounge by Zalando, as well as its outlets. Zalando SE was founded in 2008 and is headquartered in Berlin, Germany.",
    "market_cap": 6477389312,
    "logo_url": "",
    "fifty_two_week_change": -0.15499008,
    "current_price": 24.99,
    "currency": "EUR"
  }
]